### Essential basic functionality
Here we discuss a lot of the essential functionality common to the pandas data structures. To begin, let’s create some example objects like we did in the 10 minutes to pandas section:

In [1]:
import pandas as pd
import numpy as np

In [27]:
index = pd.date_range('1/1/2020', periods=8)
df = pd.DataFrame(np.random.randn(8,3), columns=list("ABC"))
s1 = pd.Series(np.random.randn(5), index=list('abcde'))

In [3]:
df

          A         B         C
0 -0.797843 -1.566682  1.082595
1 -0.185352  0.413072 -0.060972
2 -0.394191 -0.115203 -0.900000
3 -0.709627  0.052835  0.422900
4 -0.392023 -1.130488  1.587891
5  0.669664 -0.042567  0.421751
6  0.008720  0.391943  0.110008
7  0.355702  1.485283  0.848153

In [28]:
s1

a    1.620776
b    0.541058
c    0.327579
d   -0.908377
e    1.061301
dtype: float64

To view a small sample of a Series or DataFrame object, use the head() and tail() methods. The default number of elements to display is five, but you may pass a custom number.

In [5]:
df1 = pd.DataFrame(np.random.randn(20,5), columns=list("ABCDE"))

In [6]:
df1

           A         B         C         D         E
0   0.395915  0.181609 -0.622487  0.243928 -0.330517
1  -0.689886 -0.655948  0.840511  1.696312  1.989616
2   1.163173 -0.929049 -1.870966 -1.423080 -0.945983
3  -1.060279 -0.341645 -0.860424  0.153131  0.555928
4  -0.421910  0.526237 -0.940199  0.679621  1.051928
5  -0.057453 -0.885423  0.578139  0.995032 -0.622804
6  -0.609432 -2.277226  0.451133  1.673216  0.741731
7   0.264542 -1.034220  0.570514 -0.223713  0.604587
8   2.113168 -0.093788 -2.157011 -0.824673 -0.453009
9  -0.083943 -0.856062  0.708718  1.855094  0.024235
10 -2.290602  0.773753 -0.850101 -0.132758  0.312645
11 -1.050542 -0.089353  1.910401 -1.000506 -0.439505
12 -0.311324 -1.145408 -1.495117  0.512017  0.763271
13 -0.855231 -1.933850 -0.307064 -1.052078 -1.909944
14  0.954191  1.017582 -0.585000 -0.680669  0.291937
15 -0.010266 -0.074595 -1.269197  1.817215  0.235030
16  1.507140  0.426631 -0.993484 -1.468362  0.505044
17 -1.120614 -0.601173 -1.580244  0.089657 -1.179708
18  1.505820 -0.819097  0.135886  0.466360 -0.210947
19 -0.486096  0.547631  0.348722  0.279005  2.597048

In [7]:
df1.head()

          A         B         C         D         E
0  0.395915  0.181609 -0.622487  0.243928 -0.330517
1 -0.689886 -0.655948  0.840511  1.696312  1.989616
2  1.163173 -0.929049 -1.870966 -1.423080 -0.945983
3 -1.060279 -0.341645 -0.860424  0.153131  0.555928
4 -0.421910  0.526237 -0.940199  0.679621  1.051928

In [8]:
df1.tail()

           A         B         C         D         E
15 -0.010266 -0.074595 -1.269197  1.817215  0.235030
16  1.507140  0.426631 -0.993484 -1.468362  0.505044
17 -1.120614 -0.601173 -1.580244  0.089657 -1.179708
18  1.505820 -0.819097  0.135886  0.466360 -0.210947
19 -0.486096  0.547631  0.348722  0.279005  2.597048

In [9]:
df1.head(10)

          A         B         C         D         E
0  0.395915  0.181609 -0.622487  0.243928 -0.330517
1 -0.689886 -0.655948  0.840511  1.696312  1.989616
2  1.163173 -0.929049 -1.870966 -1.423080 -0.945983
3 -1.060279 -0.341645 -0.860424  0.153131  0.555928
4 -0.421910  0.526237 -0.940199  0.679621  1.051928
5 -0.057453 -0.885423  0.578139  0.995032 -0.622804
6 -0.609432 -2.277226  0.451133  1.673216  0.741731
7  0.264542 -1.034220  0.570514 -0.223713  0.604587
8  2.113168 -0.093788 -2.157011 -0.824673 -0.453009
9 -0.083943 -0.856062  0.708718  1.855094  0.024235

In [10]:
df1.tail(7)

           A         B         C         D         E
13 -0.855231 -1.933850 -0.307064 -1.052078 -1.909944
14  0.954191  1.017582 -0.585000 -0.680669  0.291937
15 -0.010266 -0.074595 -1.269197  1.817215  0.235030
16  1.507140  0.426631 -0.993484 -1.468362  0.505044
17 -1.120614 -0.601173 -1.580244  0.089657 -1.179708
18  1.505820 -0.819097  0.135886  0.466360 -0.210947
19 -0.486096  0.547631  0.348722  0.279005  2.597048

In [11]:
s = pd.Series(np.random.randn(1000))

In [12]:
s

0     -1.609151
1     -1.903660
2      1.919846
3      0.533465
4     -0.153121
         ...
995    2.343107
996   -0.639308
997   -0.164435
998   -0.766673
999   -0.684637
Length: 1000, dtype: float64

In [13]:
s.head()

0   -1.609151
1   -1.903660
2    1.919846
3    0.533465
4   -0.153121
dtype: float64

In [14]:
s.head(3)

0   -1.609151
1   -1.903660
2    1.919846
dtype: float64

In [15]:
s.tail()

995    2.343107
996   -0.639308
997   -0.164435
998   -0.766673
999   -0.684637
dtype: float64

In [16]:
s.tail(2)

998   -0.766673
999   -0.684637
dtype: float64

### Attributes and underlying data

In [18]:
df.head()

          A         B         C
0 -0.797843 -1.566682  1.082595
1 -0.185352  0.413072 -0.060972
2 -0.394191 -0.115203 -0.900000
3 -0.709627  0.052835  0.422900
4 -0.392023 -1.130488  1.587891

In [19]:
df[:3]

          A         B         C
0 -0.797843 -1.566682  1.082595
1 -0.185352  0.413072 -0.060972
2 -0.394191 -0.115203 -0.900000

In [20]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [21]:
df.columns = [x.lower() for x in df.columns]
df

          a         b         c
0 -0.797843 -1.566682  1.082595
1 -0.185352  0.413072 -0.060972
2 -0.394191 -0.115203 -0.900000
3 -0.709627  0.052835  0.422900
4 -0.392023 -1.130488  1.587891
5  0.669664 -0.042567  0.421751
6  0.008720  0.391943  0.110008
7  0.355702  1.485283  0.848153

Pandas objects (Index, Series, DataFrame) can be thought of as containers for arrays, which hold the actual data and do the actual computation. For many types, the underlying array is a numpy.ndarray. However, pandas and 3rd party libraries may extend NumPy’s type system to add support for custom arrays (see dtypes).

#### To get the actual data inside a Index or Series, use the .array property

In [22]:
s

0     -1.609151
1     -1.903660
2      1.919846
3      0.533465
4     -0.153121
         ...
995    2.343107
996   -0.639308
997   -0.164435
998   -0.766673
999   -0.684637
Length: 1000, dtype: float64

In [30]:
s1.array

<PandasArray>
[  1.620775765586102,  0.5410576624377001, 0.32757894520307024,
 -0.9083774078337099,  1.0613010473011022]
Length: 5, dtype: float64

In [29]:
s1.index.array

<PandasArray>
['a', 'b', 'c', 'd', 'e']
Length: 5, dtype: object

array will always be an ExtensionArray. The exact details of what an ExtensionArray is and why pandas uses them are a bit beyond the scope of this introduction. See dtypes for more.

If you know you need a NumPy array, use to_numpy() or numpy.asarray().

In [32]:
s1

a    1.620776
b    0.541058
c    0.327579
d   -0.908377
e    1.061301
dtype: float64

In [35]:
s1.to_numpy()

array([ 1.62077577,  0.54105766,  0.32757895, -0.90837741,  1.06130105])

In [36]:
np.asarray(s1)

array([ 1.62077577,  0.54105766,  0.32757895, -0.90837741,  1.06130105])

to_numpy() gives some control over the dtype of the resulting numpy.ndarray. For example, consider datetimes with timezones. NumPy doesn’t have a dtype to represent timezone-aware datetimes, so there are two possibly useful representations:

1. An object-dtype numpy.ndarray with Timestamp objects, each with the correct tz

2. A datetime64[ns] -dtype numpy.ndarray, where the values have been converted to UTC and the timezone discarded

Timezones may be preserved with dtype=object

In [40]:
s = pd.Series(pd.date_range('2020', periods=3, tz='CET'))
s

0   2020-01-01 00:00:00+01:00
1   2020-01-02 00:00:00+01:00
2   2020-01-03 00:00:00+01:00
dtype: datetime64[ns, CET]

In [43]:
s.to_numpy(dtype=object)

array([Timestamp('2020-01-01 00:00:00+0100', tz='CET', freq='D'),
       Timestamp('2020-01-02 00:00:00+0100', tz='CET', freq='D'),
       Timestamp('2020-01-03 00:00:00+0100', tz='CET', freq='D')],
      dtype=object)

In [44]:
s.to_numpy(dtype="datetime64[ns]")

array(['2019-12-31T23:00:00.000000000', '2020-01-01T23:00:00.000000000',
       '2020-01-02T23:00:00.000000000'], dtype='datetime64[ns]')

Getting the “raw data” inside a DataFrame is possibly a bit more complex. When your DataFrame only has a single data type for all the columns, DataFrame.to_numpy() will return the underlying data:

In [45]:
df.head()

          A         B         C
0  0.231638  0.024741 -2.704896
1 -0.614665 -0.661737 -1.140431
2 -0.925969  0.515699  0.562020
3 -0.622517 -1.800619  0.780108
4  1.336340  0.696162 -0.787772

In [46]:
df.to_numpy()

array([[ 0.23163828,  0.02474122, -2.7048964 ],
       [-0.61466463, -0.66173742, -1.14043086],
       [-0.92596947,  0.51569948,  0.56202026],
       [-0.62251671, -1.80061934,  0.78010768],
       [ 1.33633951,  0.69616244, -0.78777161],
       [ 0.37147817,  0.50942978,  1.48282202],
       [-0.93548881, -0.1916357 , -0.665967  ],
       [ 0.3720303 ,  0.14464557, -1.27937424]])

If a DataFrame contains homogeneously-typed data, the ndarray can actually be modified in-place, and the changes will be reflected in the data structure. For heterogeneous data (e.g. some of the DataFrame’s columns are not all the same dtype), this will not be the case. The values attribute itself, unlike the axis labels, cannot be assigned to.

#### Note:

1. When working with heterogeneous data, the dtype of the resulting ndarray will be chosen to accommodate all of the data involved. For example, if strings are involved, the result will be of object dtype. If there are only floats and integers, the resulting array will be of float dtype.

In the past, pandas recommended Series.values or DataFrame.values for extracting the data from a Series or DataFrame. You’ll still find references to these in old code bases and online. Going forward, we recommend avoiding .values and using .array or .to_numpy(). .values has the following drawbacks:

1. When your Series contains an extension type, it’s unclear whether Series.values returns a NumPy array or the extension array. Series.array will always return an ExtensionArray, and will never copy data. Series.to_numpy() will always return a NumPy array, potentially at the cost of copying / coercing values.

2. When your DataFrame contains a mixture of data types, DataFrame.values may involve copying data and coercing values to a common dtype, a relatively expensive operation. DataFrame.to_numpy(), being a method, makes it clearer that the returned NumPy array may not be a view on the same data in the DataFrame.

### Accelerated operations
pandas has support for accelerating certain types of binary numerical and boolean operations using the numexpr library and the bottleneck libraries.

These libraries are especially useful when dealing with large data sets, and provide large speedups. numexpr uses smart chunking, caching, and multiple cores. bottleneck is a set of specialized cython routines that are especially fast when dealing with arrays that have nans.

These are both enabled to be used by default, you can control this by setting the options:

In [48]:
pd.set_option('compute.use_bottleneck', True)
pd.set_option('compute.use_numexpr', True)

### Flexible binary operations
With binary operations between pandas data structures, there are two key points of interest:

1. Broadcasting behavior between higher- (e.g. DataFrame) and lower-dimensional (e.g. Series) objects.

2. Missing data in computations.

We will demonstrate how to manage these issues independently, though they can be handled simultaneously.

### Matching / broadcasting behavior
DataFrame has the methods add(), sub(), mul(), div() and related functions radd(), rsub(), … for carrying out binary operations. For broadcasting behavior, Series input is of primary interest. Using these functions, you can use to either match on the index or columns via the axis keyword:

In [49]:
df = pd.DataFrame({
    'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
    'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
    'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})
df

        one       two     three
a  1.605764 -0.661170       NaN
b -1.004859 -1.999842 -1.462083
c -0.996227  0.743647  1.639599
d       NaN  0.648956  0.397130

In [50]:
row = df.iloc[1]
column = df['two']

In [51]:
df.sub(row, axis='columns')

        one       two     three
a  2.610623  1.338672       NaN
b  0.000000  0.000000  0.000000
c  0.008633  2.743489  3.101682
d       NaN  2.648797  1.859213

In [52]:
df.sub(row, axis=1)

        one       two     three
a  2.610623  1.338672       NaN
b  0.000000  0.000000  0.000000
c  0.008633  2.743489  3.101682
d       NaN  2.648797  1.859213

In [53]:
df.sub(column, axis='index')

        one  two     three
a  2.266933  0.0       NaN
b  0.994982  0.0  0.537758
c -1.739874  0.0  0.895952
d       NaN  0.0 -0.251826

In [54]:
df.add(column, axis=0)

        one       two     three
a  0.944594 -1.322339       NaN
b -3.004701 -3.999683 -3.461925
c -0.252580  1.487294  2.383246
d       NaN  1.297912  1.046085

Series and Index also support the divmod() builtin. This function takes the floor division and modulo operation at the same time returning a two-tuple of the same type as the left hand side. For example:

In [55]:
df1 = df.copy()
df1

        one       two     three
a  1.605764 -0.661170       NaN
b -1.004859 -1.999842 -1.462083
c -0.996227  0.743647  1.639599
d       NaN  0.648956  0.397130

In [56]:
s = pd.Series(np.random.randn(300))
s.head(5)

0    1.105248
1   -0.353884
2   -0.174428
3   -0.667116
4   -1.872142
dtype: float64

In [57]:
div, rem = divmod(s, 3)
div

0      0.0
1     -1.0
2     -1.0
3     -1.0
4     -1.0
      ...
295    0.0
296    0.0
297    0.0
298    0.0
299   -1.0
Length: 300, dtype: float64

In [58]:
rem

0      1.105248
1      2.646116
2      2.825572
3      2.332884
4      1.127858
         ...
295    0.808348
296    0.416146
297    1.235302
298    1.605301
299    2.049705
Length: 300, dtype: float64

In [65]:
idx = pd.Index(np.arange(10), dtype=np.int64)

In [66]:
idx

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [67]:
div, rem = divmod(idx, 3)

In [68]:
div

Int64Index([0, 0, 0, 1, 1, 1, 2, 2, 2, 3], dtype='int64')

In [69]:
rem

Int64Index([0, 1, 2, 0, 1, 2, 0, 1, 2, 0], dtype='int64')

### Missing data / operations with fill values
In Series and DataFrame, the arithmetic functions have the option of inputting a fill_value, namely a value to substitute when at most one of the values at a location are missing. For example, when adding two DataFrame objects, you may wish to treat NaN as 0 unless both DataFrames are missing that value, in which case the result will be NaN (you can later replace NaN with some other value using fillna if you wish).

In [70]:
df = pd.DataFrame({
    'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
    'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
    'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})
df

        one       two     three
a -1.778770 -1.313548       NaN
b -0.846897  1.197507 -0.726394
c  2.071874  0.344307  0.530739
d       NaN -0.798917  0.689766

In [71]:
df2 = df.copy()

In [75]:
df2.three[0] = 1
df2

        one       two     three
a -1.778770 -1.313548  1.000000
b -0.846897  1.197507 -0.726394
c  2.071874  0.344307  0.530739
d       NaN -0.798917  0.689766

In [72]:
df + df2

        one       two     three
a -3.557541 -2.627097       NaN
b -1.693795  2.395014 -1.452788
c  4.143747  0.688613  1.061478
d       NaN -1.597834  1.379531

In [76]:
df.add(df2, fill_value= 0)

        one       two     three
a -3.557541 -2.627097  1.000000
b -1.693795  2.395014 -1.452788
c  4.143747  0.688613  1.061478
d       NaN -1.597834  1.379531

### Flexible comparisons
Series and DataFrame have the binary comparison methods eq, ne, lt, gt, le, and ge whose behavior is analogous to the binary arithmetic operations described above:

In [77]:
df = pd.DataFrame({
    'one': pd.Series(np.arange(3), index=['a', 'b', 'c']),
    'two': pd.Series(np.arange(4,8), index=['a', 'b', 'c', 'd']),
    'three': pd.Series(np.arange(3), index=['b', 'c', 'd'])})
df

   one  two  three
a  0.0    4    NaN
b  1.0    5    0.0
c  2.0    6    1.0
d  NaN    7    2.0

In [78]:
df2 = df*2
df2

   one  two  three
a  0.0    8    NaN
b  2.0   10    0.0
c  4.0   12    2.0
d  NaN   14    4.0

In [79]:
df.eq(df2)

     one    two  three
a   True  False  False
b  False  False   True
c  False  False  False
d  False  False  False

In [80]:
df.ne(df2)

     one   two  three
a  False  True   True
b   True  True  False
c   True  True   True
d   True  True   True

In [81]:
df.lt(df2)

     one   two  three
a  False  True  False
b   True  True  False
c   True  True   True
d  False  True   True

In [82]:
df.gt(df2)

     one    two  three
a  False  False  False
b  False  False  False
c  False  False  False
d  False  False  False

In [83]:
df.le(df2)

     one   two  three
a   True  True  False
b   True  True   True
c   True  True   True
d  False  True   True

In [84]:
df.ge(df2)

     one    two  three
a   True  False  False
b  False  False   True
c  False  False  False
d  False  False  False

These operations produce a pandas object of the same type as the left-hand-side input that is of dtype bool. These boolean objects can be used in indexing operations, see the section on Boolean indexing.

### Boolean reductions
You can apply the reductions: empty, any(), all(), and bool() to provide a way to summarize a boolean result.

In [86]:
(df > 0).all()

one      False
two       True
three    False
dtype: bool

In [87]:
(df > 0).any()

one      True
two      True
three    True
dtype: bool

You can reduce to a final boolean value.

In [88]:
(df>0).all().any()

True

You can test if a pandas object is empty, via the empty property.

In [89]:
df

   one  two  three
a  0.0    4    NaN
b  1.0    5    0.0
c  2.0    6    1.0
d  NaN    7    2.0

In [90]:
df.empty # if not empty then return false

False

In [91]:
pd.DataFrame(columns=list('ABS')).empty # if empty then return true

True

To evaluate single-element pandas objects in a boolean context, use the method bool():

In [92]:
pd.Series([True]).bool()

True

In [93]:
pd.Series([False]).bool()

False

In [94]:
pd.DataFrame([[True]]).bool()

True

In [95]:
pd.DataFrame([[False]]).bool()

False

### Comparing if objects are equivalent
Often you may find that there is more than one way to compute the same result. As a simple example, consider df + df and df * 2. To test that these two computations produce the same result, given the tools shown above, you might imagine using (df + df == df * 2).all(). But in fact, this expression is False:

In [96]:
df + df == df * 2

     one   two  three
a   True  True  False
b   True  True   True
c   True  True   True
d  False  True   True

In [97]:
(df + df == df * 2).all()

one      False
two       True
three    False
dtype: bool

Notice that the boolean DataFrame df + df == df * 2 contains some False values! This is because NaNs do not compare as equals:

In [98]:
np.nan == np.nan

False

So, NDFrames (such as Series and DataFrames) have an equals() method for testing equality, with NaNs in corresponding locations treated as equal.

In [99]:
(df + df).equals(df * 2)

True

Note that the Series or DataFrame index needs to be in the same order for equality to be True:

In [100]:
df1 = pd.DataFrame({'col': ['foo', 0, np.nan]})
df2 = pd.DataFrame({'col': [np.nan, 0, 'foo']}, index=[2, 1, 0])

In [101]:
df1

   col
0  foo
1    0
2  NaN

In [102]:
df2

   col
2  NaN
1    0
0  foo

In [103]:
df1.equals(df2)

False

In [105]:
df1.equals(df2.sort_index())

True

### Comparing array-like objects
You can conveniently perform element-wise comparisons when comparing a pandas data structure with a scalar value:

In [106]:
pd.Series(['foo', 'bar', 'baz']) == 'foo'

0     True
1    False
2    False
dtype: bool

In [107]:
pd.Index(['foo', 'bar', 'baz']) == 'foo'

array([ True, False, False])

Pandas also handles element-wise comparisons between different array-like objects of the same length:

In [108]:
pd.Series(['foo', 'bar', 'baz']) == pd.Index(['foo', 'bar', 'qux'])

0     True
1     True
2    False
dtype: bool

In [109]:
pd.Series(['foo', 'bar', 'baz']) == np.array(['foo', 'bar', 'qux'])

0     True
1     True
2    False
dtype: bool

Note that this is different from the NumPy behavior where a comparison can be broadcast:

In [110]:
np.array([1, 2, 3]) == np.array([2])

array([False,  True, False])

### Combining overlapping data sets
A problem occasionally arising is the combination of two similar data sets where values in one are preferred over the other. An example would be two data series representing a particular economic indicator where one is considered to be of “higher quality”. However, the lower quality series might extend further back in history or have more complete data coverage. As such, we would like to combine two DataFrame objects where missing values in one DataFrame are conditionally filled with like-labeled values from the other DataFrame. The function implementing this operation is combine_first(), which we illustrate:

In [111]:
df1 = pd.DataFrame({'A': [1., np.nan, 3., 5., np.nan],'B': [np.nan, 2., 3., np.nan, 6.]})
df2 = pd.DataFrame({'A': [5., 2., 4., np.nan, 3., 7.],'B': [np.nan, np.nan, 3., 4., 6., 8.]})

In [112]:
df1

     A    B
0  1.0  NaN
1  NaN  2.0
2  3.0  3.0
3  5.0  NaN
4  NaN  6.0

In [113]:
df2

     A    B
0  5.0  NaN
1  2.0  NaN
2  4.0  3.0
3  NaN  4.0
4  3.0  6.0
5  7.0  8.0

In [114]:
df1.combine_first(df2)

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  5.0  4.0
4  3.0  6.0
5  7.0  8.0

### Descriptive statistics
There exists a large number of methods for computing descriptive statistics and other related operations on Series, DataFrame. Most of these are aggregations (hence producing a lower-dimensional result) like sum(), mean(), and quantile(), but some of them, like cumsum() and cumprod(), produce an object of the same size. Generally speaking, these methods take an axis argument, just like ndarray.{sum, std, …}, but the axis can be specified by name or integer:

1. Series: no axis argument needed

2. DataFrame: “index” (axis=0, default), “columns” (axis=1)

In [176]:
df = pd.DataFrame({
    'one': pd.Series(np.arange(3), index=['a', 'b', 'c']),
    'two': pd.Series(np.arange(4,8), index=['a', 'b', 'c', 'd']),
    'three': pd.Series(np.arange(3), index=['b', 'c', 'd'])})
df.one[1] = 2
df

/home/nilesh/.local/lib/python3.6/site-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

   one  two  three
a  0.0    4    NaN
b  2.0    5    0.0
c  2.0    6    1.0
d  NaN    7    2.0

In [116]:
df.mean(axis=0)

one      1.0
two      5.5
three    1.0
dtype: float64

In [117]:
df.mean(axis=1)

a    2.0
b    2.0
c    3.0
d    4.5
dtype: float64

All such methods have a skipna option signaling whether to exclude missing data (True by default):

In [118]:
df.mean(0, skipna=False)

one      NaN
two      5.5
three    NaN
dtype: float64

In [119]:
df.mean(1, skipna=False)

a    NaN
b    2.0
c    3.0
d    NaN
dtype: float64

In [120]:
df.sum(0, skipna=False)

one       NaN
two      22.0
three     NaN
dtype: float64

In [121]:
df.sum(1, skipna=True)

a    4.0
b    6.0
c    9.0
d    9.0
dtype: float64

Combined with the broadcasting / arithmetic behavior, one can describe various statistical procedures, like standardization (rendering data zero mean and standard deviation of 1), very concisely:

In [123]:
ts_stand = (df - df.mean())/ df.std()
ts_stand.std()

one      1.0
two      1.0
three    1.0
dtype: float64

Note that methods like cumsum() and cumprod() preserve the location of NaN values. This is somewhat different from expanding() and rolling(). For more details please see this note.

In [128]:
df.cumsum(axis=0)

   one  two  three
a  0.0    4    NaN
b  1.0    9    0.0
c  3.0   15    1.0
d  NaN   22    3.0

In [129]:
df.cumsum(axis=1)

   one  two  three
a  0.0  4.0    NaN
b  1.0  6.0    6.0
c  2.0  8.0    9.0
d  NaN  7.0    9.0

In [130]:
df.cummax(axis=0)

   one  two  three
a  0.0    4    NaN
b  1.0    5    0.0
c  2.0    6    1.0
d  NaN    7    2.0

In [132]:
df.cummax(axis=1)

   one  two  three
a  0.0  4.0    NaN
b  1.0  5.0    5.0
c  2.0  6.0    6.0
d  NaN  7.0    7.0

In [134]:
df.cummin(axis=0)

   one  two  three
a  0.0    4    NaN
b  0.0    4    0.0
c  0.0    4    0.0
d  NaN    4    0.0

In [136]:
df.cummin(axis=1)

   one  two  three
a  0.0  0.0    NaN
b  1.0  1.0    0.0
c  2.0  2.0    1.0
d  NaN  7.0    2.0

In [135]:
df.cumprod(axis=0)

   one  two  three
a  0.0    4    NaN
b  0.0   20    0.0
c  0.0  120    0.0
d  NaN  840    0.0

In [138]:
df.cumprod(axis=1)

   one   two  three
a  0.0   0.0    NaN
b  1.0   5.0    0.0
c  2.0  12.0   12.0
d  NaN   7.0   14.0

Here is a quick reference summary table of common functions. Each also takes an optional level parameter which applies only if the object has a hierarchical index.

In [ ]:
# count  --> Number of non-NA observations

In [141]:
df.count(axis=0)

one      3
two      4
three    3
dtype: int64

In [142]:
df.count(axis=1)

a    2
b    3
c    3
d    2
dtype: int64

In [143]:
df.one.count()

3

In [145]:
# sum  --> Sum of values

In [146]:
df.sum(axis=0)

one       3.0
two      22.0
three     3.0
dtype: float64

In [147]:
df.sum(axis=1)

a    4.0
b    6.0
c    9.0
d    9.0
dtype: float64

In [149]:
df.two.sum()

22

In [150]:
# mean  --> Mean of values

In [151]:
df.mean(axis=0)

one      1.0
two      5.5
three    1.0
dtype: float64

In [152]:
df.mean(axis=1)

a    2.0
b    2.0
c    3.0
d    4.5
dtype: float64

In [153]:
df.three.mean()

1.0

In [154]:
# mad  --> Mean absolute deviation

In [156]:
df.mad(axis=0)

one      0.666667
two      1.000000
three    0.666667
dtype: float64

In [157]:
df.mad(axis=1)

a    2.0
b    2.0
c    2.0
d    2.5
dtype: float64

In [158]:
df.three.mad()

0.6666666666666666

In [159]:
# median  --> Arithmetic median of values

In [160]:
df.median(axis=0)

one      1.0
two      5.5
three    1.0
dtype: float64

In [161]:
df.median(axis=1)

a    2.0
b    1.0
c    2.0
d    4.5
dtype: float64

In [162]:
df.two.median()

5.5

In [163]:
# min  --> Minimum

In [164]:
df.min(axis=0)

one      0.0
two      4.0
three    0.0
dtype: float64

In [165]:
df.min(axis=1)

a    0.0
b    0.0
c    1.0
d    2.0
dtype: float64

In [166]:
df.one.mean()

1.0

In [167]:
# max  --> Maximum

In [168]:
df.max(axis=0)

one      2.0
two      7.0
three    2.0
dtype: float64

In [169]:
df.max(axis=1)

a    4.0
b    5.0
c    6.0
d    7.0
dtype: float64

In [170]:
df.three.max()

2.0

In [171]:
# mode  --> Mode

In [177]:
df.mode(axis=0)

   one  two  three
0  2.0    4    0.0
1  NaN    5    1.0
2  NaN    6    2.0
3  NaN    7    NaN

In [178]:
df.mode(axis=1)

     0    1    2
a  0.0  4.0  NaN
b  0.0  2.0  5.0
c  1.0  2.0  6.0
d  2.0  7.0  NaN

In [181]:
df.one.mode()

0    2.0
dtype: float64

In [182]:
# abs  --> Absolute Value

In [185]:
df.abs()

   one  two  three
a  0.0  4.0    NaN
b  2.0  5.0    0.0
c  2.0  6.0    1.0
d  NaN  7.0    2.0

In [186]:
df.one.abs()

a    0.0
b    2.0
c    2.0
d    NaN
Name: one, dtype: float64

In [187]:
# prod  --> Product of values

In [189]:
df.prod(axis=0)

one        0.0
two      840.0
three      0.0
dtype: float64

In [190]:
df.two.prod()

840

In [191]:
df.prod(axis=1)

a     0.0
b     0.0
c    12.0
d    14.0
dtype: float64

In [192]:
# std  --> Bessel-corrected sample standard deviation

In [193]:
df.std(axis=0)

one      1.154701
two      1.290994
three    1.000000
dtype: float64

In [194]:
df.std(axis=1)

a    2.828427
b    2.516611
c    2.645751
d    3.535534
dtype: float64

In [195]:
df.two.std()

1.2909944487358056

In [196]:
# var  --> Unbiased variance

In [197]:
df.var(axis=0)

one      1.333333
two      1.666667
three    1.000000
dtype: float64

In [198]:
df.var(axis=1)

a     8.000000
b     6.333333
c     7.000000
d    12.500000
dtype: float64

In [199]:
df.one.var()

1.3333333333333335

In [200]:
# sem  --. Standard error of the mean

In [201]:
df.sem(axis=0)

one      0.666667
two      0.645497
three    0.577350
dtype: float64

In [202]:
df.sem(axis=1)

a    2.000000
b    1.452966
c    1.527525
d    2.500000
dtype: float64

In [203]:
df.two.sem()

0.6454972243679028

In [204]:
# skew  --> Sample skewness (3rd moment)

In [205]:
df.skew(axis=0)

one     -1.732051
two      0.000000
three    0.000000
dtype: float64

In [206]:
df.skew(axis=1)

a         NaN
b    0.585583
c    1.457863
d         NaN
dtype: float64

In [207]:
df.one.skew()

-1.732050807568877

In [208]:
#kurt  --> Sample kurtosis (4th moment)

In [209]:
df.kurt(axis=0)

one      NaN
two     -1.2
three    NaN
dtype: float64

In [210]:
df.kurt(axis=1)

a   NaN
b   NaN
c   NaN
d   NaN
dtype: float64

In [211]:
df.two.kurt()

-1.1999999999999993

In [212]:
# quantile  --> Sample quantile (value at %)

In [213]:
df.quantile(q=0.95, axis=0)

one      2.00
two      6.85
three    1.90
Name: 0.95, dtype: float64

In [214]:
df.quantile(q=0.85, axis=1)

a    3.40
b    4.10
c    4.80
d    6.25
Name: 0.85, dtype: float64

In [215]:
df.one.quantile(q=0.90)

2.0

Note that by chance some NumPy methods, like mean, std, and sum, will exclude NAs on Series input by default:

In [216]:
np.mean(df['three'])

1.0

In [217]:
np.mean(df['three'].to_numpy())

nan

#### Series.nunique() will return the number of unique non-NA values in a Series:

In [218]:
s = pd.Series(np.arange(100))

In [219]:
s[20:] = np.nan
s[:10] = 5

In [220]:
s.nunique()

11

In [221]:
df.one.nunique()

2

In [222]:
df.nunique()

one      2
two      4
three    3
dtype: int64

In [227]:
s[:10].nunique()

1

### Summarizing data: describe
There is a convenient describe() function which computes a variety of summary statistics about a Series or the columns of a DataFrame (excluding NAs of course):

In [228]:
s = pd.Series(np.random.randn(1000))

In [229]:
s[::2] = np.nan

In [231]:
s.head(6)

0         NaN
1    0.986567
2         NaN
3    0.869956
4         NaN
5    0.191660
dtype: float64

In [232]:
s.describe()

count    500.000000
mean       0.033164
std        0.985121
min       -2.652783
25%       -0.654316
50%        0.003760
75%        0.691497
max        3.920087
dtype: float64

In [237]:
df1 = pd.DataFrame(np.random.randn(1000,5), columns=list('ABCDE'))
df1[::2] = np.nan
df1.head(5)

          A         B         C         D         E
0       NaN       NaN       NaN       NaN       NaN
1  1.379110 -0.561486  0.944649  1.472818  0.511644
2       NaN       NaN       NaN       NaN       NaN
3  0.899486  0.403593  1.180881 -0.395009 -0.851372
4       NaN       NaN       NaN       NaN       NaN

In [238]:
df1.describe()

                A           B           C           D           E
count  500.000000  500.000000  500.000000  500.000000  500.000000
mean    -0.043041   -0.061036    0.070986    0.044209    0.051274
std      0.961073    0.988657    0.968170    0.971568    0.961472
min     -3.094309   -3.061511   -2.585695   -3.107595   -2.916690
25%     -0.680632   -0.695544   -0.603989   -0.628455   -0.556466
50%     -0.078290   -0.115864    0.044574    0.069208    0.036143
75%      0.647948    0.559967    0.711592    0.722102    0.686231
max      2.576503    3.160811    2.935974    2.857510    2.904998

You can select specific percentiles to include in the output:

In [240]:
df1.describe(percentiles=[0.2, 0.5,0.7])

                A           B           C           D           E
count  500.000000  500.000000  500.000000  500.000000  500.000000
mean    -0.043041   -0.061036    0.070986    0.044209    0.051274
std      0.961073    0.988657    0.968170    0.971568    0.961472
min     -3.094309   -3.061511   -2.585695   -3.107595   -2.916690
20%     -0.847340   -0.873536   -0.789391   -0.775931   -0.720655
50%     -0.078290   -0.115864    0.044574    0.069208    0.036143
70%      0.437693    0.404943    0.531568    0.581597    0.562130
max      2.576503    3.160811    2.935974    2.857510    2.904998

By default, the median is always included.

For a non-numerical Series object, describe() will give a simple summary of the number of unique values and most frequently occurring values:

In [241]:
s = pd.Series(['a', 'a', 'b', 'b', 'a', 'a', np.nan, 'c', 'd', 'a'])
s.head()

0    a
1    a
2    b
3    b
4    a
dtype: object

In [242]:
s.describe()

count     9
unique    4
top       a
freq      5
dtype: object

Note that on a mixed-type DataFrame object, describe() will restrict the summary to include only numerical columns or, if none are, only categorical columns:

In [243]:
frame = pd.DataFrame({'a': ['Yes', 'Yes', 'No', 'No'], 'b': range(4)})

In [244]:
frame

     a  b
0  Yes  0
1  Yes  1
2   No  2
3   No  3

In [245]:
frame.describe()

              b
count  4.000000
mean   1.500000
std    1.290994
min    0.000000
25%    0.750000
50%    1.500000
75%    2.250000
max    3.000000

This behavior can be controlled by providing a list of types as include/exclude arguments. The special value all can also be used:

In [246]:
frame.describe(include=['object'])

          a
count     4
unique    2
top     Yes
freq      2

In [248]:
frame.describe(include=['number'])

              b
count  4.000000
mean   1.500000
std    1.290994
min    0.000000
25%    0.750000
50%    1.500000
75%    2.250000
max    3.000000

In [250]:
frame.describe(include='all')

          a         b
count     4  4.000000
unique    2       NaN
top     Yes       NaN
freq      2       NaN
mean    NaN  1.500000
std     NaN  1.290994
min     NaN  0.000000
25%     NaN  0.750000
50%     NaN  1.500000
75%     NaN  2.250000
max     NaN  3.000000

### Index of min/max values
The idxmin() and idxmax() functions on Series and DataFrame compute the index labels with the minimum and maximum corresponding values:

In [2]:
s = pd.Series(np.random.randn(5))
s

0   -0.488619
1    1.636024
2   -0.331100
3    2.224023
4    1.349233
dtype: float64

In [3]:
s.idxmax(), s.idxmin()

(3, 0)

In [4]:
df = pd.DataFrame(np.random.randn(5,3), columns=list('ABC'))
df

          A         B         C
0  0.759765 -1.470960 -0.543502
1 -0.101982  0.706310  0.857501
2  0.014013  0.464633 -0.042682
3 -2.509807 -0.612347 -0.322266
4 -0.547457 -1.533307 -1.146260

In [5]:
df.idxmax(axis=0)

A    0
B    1
C    1
dtype: int64

In [6]:
df.idxmax(axis=1)

0    A
1    C
2    B
3    C
4    A
dtype: object

In [7]:
df.idxmin(axis=0)

A    3
B    4
C    4
dtype: int64

In [8]:
df.idxmin(axis=1)

0    B
1    A
2    C
3    A
4    B
dtype: object

When there are multiple rows (or columns) matching the minimum or maximum value, idxmin() and idxmax() return the first matching index:

In [12]:
df1 = pd.DataFrame(pd.Series([1,2,3,1,4], index=list('abcde')), columns=list('A'))
df1

   A
a  1
b  2
c  3
d  1
e  4

In [13]:
df1.idxmin(axis=0)

A    a
dtype: object

In [14]:
df1['A'].idxmin(axis=0)

'a'

### Value counts (histogramming) / mode
The value_counts() Series method and top-level function computes a histogram of a 1D array of values. It can also be used as a function on regular arrays:

In [16]:
data = np.random.randint(0,6, size=50)
data

array([5, 4, 2, 1, 2, 2, 5, 1, 1, 0, 2, 5, 5, 2, 2, 0, 0, 2, 4, 5, 5, 2,
       0, 1, 2, 4, 2, 1, 3, 2, 0, 0, 2, 2, 3, 1, 5, 2, 4, 0, 3, 4, 1, 5,
       3, 1, 3, 2, 5, 3])

In [18]:
s = pd.Series(data)

In [19]:
s.value_counts()

2    15
5     9
1     8
0     7
3     6
4     5
dtype: int64

In [20]:
pd.value_counts(data)

2    15
5     9
1     8
0     7
3     6
4     5
dtype: int64

The value_counts() method can be used to count combinations across multiple columns. By default all columns are used but a subset can be selected using the subset argument.

In [22]:
data = {"a": [1, 2, 3, 4], "b": ["x", "x", "y", "y"]}
df = pd.DataFrame(data)
df

   a  b
0  1  x
1  2  x
2  3  y
3  4  y

In [26]:
df.a.value_counts()

4    1
3    1
2    1
1    1
Name: a, dtype: int64

Similarly, you can get the most frequently occurring value(s), i.e. the mode, of the values in a Series or DataFrame:

In [28]:
s = pd.Series(np.random.randint(0,10, size=50))

In [31]:
s.mode()

0    4
dtype: int64

In [32]:
df5 = pd.DataFrame({"A": np.random.randint(0, 7, size=50),"B": np.random.randint(-10, 15, size=50)})

In [34]:
df5.head()

   A   B
0  5   1
1  6  12
2  5   6
3  0  -8
4  5   6

In [33]:
df5.mode()

   A  B
0  5  4

### Discretization and quantiling
Continuous values can be discretized using the cut() (bins based on values) and qcut() (bins based on sample quantiles) functions:

In [35]:
arr = np.random.randn(20)

In [36]:
pd.cut(arr, 4)

[(-0.981, -0.0244], (-0.981, -0.0244], (0.932, 1.889], (0.932, 1.889], (-1.941, -0.981], ..., (-0.981, -0.0244], (0.932, 1.889], (-0.981, -0.0244], (-1.941, -0.981], (-0.981, -0.0244]]
Length: 20
Categories (4, interval[float64]): [(-1.941, -0.981] < (-0.981, -0.0244] < (-0.0244, 0.932] < (0.932, 1.889]]

In [38]:
pd.cut(arr, [-1,0,1])

[(-1.0, 0.0], (-1.0, 0.0], NaN, NaN, NaN, ..., (-1.0, 0.0], NaN, (-1.0, 0.0], NaN, (-1.0, 0.0]]
Length: 20
Categories (2, interval[int64]): [(-1, 0] < (0, 1]]

In [42]:
arr1 = np.arange(20, dtype=int)
arr1

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19])

In [43]:
pd.cut(arr1,4)

[(-0.019, 4.75], (-0.019, 4.75], (-0.019, 4.75], (-0.019, 4.75], (-0.019, 4.75], ..., (14.25, 19.0], (14.25, 19.0], (14.25, 19.0], (14.25, 19.0], (14.25, 19.0]]
Length: 20
Categories (4, interval[float64]): [(-0.019, 4.75] < (4.75, 9.5] < (9.5, 14.25] < (14.25, 19.0]]

In [44]:
pd.cut(arr1, bins=4, labels=['les_5','less_10','less15', 'less20'])

[les_5, les_5, les_5, les_5, les_5, ..., less20, less20, less20, less20, less20]
Length: 20
Categories (4, object): [les_5 < less_10 < less15 < less20]

qcut() computes sample quantiles. For example, we could slice up some normally distributed data into equal-size quartiles like so:

In [45]:
arr = np.random.randn(30)

In [47]:
f = pd.qcut(arr, q=[0.25,0.50,0.75,1])

In [48]:
pd.value_counts(f)

(0.902, 1.596]      8
(0.0756, 0.902]     7
(-0.717, 0.0756]    7
dtype: int64

We can also pass infinite values to define the bins:

In [49]:
arr = np.random.randn(30)
pd.cut(arr, [-np.inf, 0 , np.inf])

[(0.0, inf], (0.0, inf], (0.0, inf], (-inf, 0.0], (0.0, inf], ..., (0.0, inf], (0.0, inf], (-inf, 0.0], (0.0, inf], (-inf, 0.0]]
Length: 30
Categories (2, interval[float64]): [(-inf, 0.0] < (0.0, inf]]

### Function application
To apply your own or another library’s functions to pandas objects, you should be aware of the three methods below. The appropriate method to use depends on whether your function expects to operate on an entire DataFrame or Series, row- or column-wise, or elementwise.

1. Tablewise Function Application: pipe()

2. Row or Column-wise Function Application: apply()

3. Aggregation API: agg() and transform()

4. Applying Elementwise Functions: applymap()

#### Tablewise function application
DataFrames and Series can be passed into functions. However, if the function needs to be called in a chain, consider using the pipe() method.

In [1]:
import numpy as np
import pandas as pd

def extract_city_name(df):
    df['city_name'] = df['city_and_code'].str.split('|').str.get(0)
    return df


def add_con_code(df, con_code=None):
    df['city_con_code'] = df['city_name'] + con_code
    return df

In [6]:
df1 = pd.DataFrame({'city_and_code': ['Lonar | 204054']})

In [7]:
df1

    city_and_code
0  Lonar | 204054

In [4]:
d = add_con_code(extract_city_name(df1), con_code='MH')
d

    city_and_code city_name city_con_code
0  Lonar | 204054    Lonar       Lonar MH

In [5]:
df1

    city_and_code city_name city_con_code
0  Lonar | 204054    Lonar       Lonar MH

In [9]:
df1.pipe(extract_city_name).pipe(add_con_code, con_code='MK')

    city_and_code city_name city_con_code
0  Lonar | 204054    Lonar       Lonar MK

### Row or column-wise function application
Arbitrary functions can be applied along the axes of a DataFrame using the apply() method, which, like the descriptive statistics methods, takes an optional axis argument:

In [10]:
data = {'One': [1,2,3,4,5], 'Two':[6,7,8,9,10], 'Three':[11,12,13,14,15]}
df = pd.DataFrame(data)
df

   One  Two  Three
0    1    6     11
1    2    7     12
2    3    8     13
3    4    9     14
4    5   10     15

In [13]:
df.apply(np.mean)

One       3.0
Two       8.0
Three    13.0
dtype: float64

In [14]:
df.apply(np.mean, axis=1)

0     6.0
1     7.0
2     8.0
3     9.0
4    10.0
dtype: float64

In [15]:
df.apply(np.exp)

          One           Two         Three
0    2.718282    403.428793  5.987414e+04
1    7.389056   1096.633158  1.627548e+05
2   20.085537   2980.957987  4.424134e+05
3   54.598150   8103.083928  1.202604e+06
4  148.413159  22026.465795  3.269017e+06

In [16]:
df.apply(np.cumsum)

   One  Two  Three
0    1    6     11
1    3   13     23
2    6   21     36
3   10   30     50
4   15   40     65

In [17]:
df.apply(lambda x: x.max()-x.min())

One      4
Two      4
Three    4
dtype: int64

The apply() method will also dispatch on a string method name.

In [18]:
df.apply('mean', axis=0)

One       3.0
Two       8.0
Three    13.0
dtype: float64

In [19]:
df.apply('mean', axis=1)

0     6.0
1     7.0
2     8.0
3     9.0
4    10.0
dtype: float64

The return type of the function passed to apply() affects the type of the final output from DataFrame.apply for the default behaviour:

1. If the applied function returns a Series, the final output is a DataFrame. The columns match the index of the Series returned by the applied function.

2. If the applied function returns any other type, the final output is a Series.

This default behaviour can be overridden using the result_type, which accepts three options: reduce, broadcast, and expand. These will determine how list-likes return values expand (or not) to a DataFrame.

apply() combined with some cleverness can be used to answer many questions about a data set. For example, suppose we wanted to extract the date where the maximum value for each column occurred:

In [20]:
df2 = pd.DataFrame(np.random.randn(1000,3), columns=list('ABC'), index=pd.date_range('1/1/2020',periods=1000))
df2.head()

                   A         B         C
2020-01-01 -1.101644  0.147166 -0.547999
2020-01-02  1.585389  0.017084 -0.360708
2020-01-03  0.634659 -1.653793  1.102048
2020-01-04  1.410233  1.415322 -0.402683
2020-01-05  1.188384 -0.035467  0.281056

In [22]:
df2.apply(lambda x: x.idxmax())

A   2021-04-20
B   2020-01-25
C   2021-02-27
dtype: datetime64[ns]

You may also pass additional arguments and keyword arguments to the apply() method. For instance, consider the following function you would like to apply:`m

In [24]:
def subtarct_and_divide(x, sub, divide=1):
    return (x - sub)/ divide

In [26]:
df2.apply(subtarct_and_divide, args=(2,), divide=2).head()

                   A         B         C
2020-01-01 -1.550822 -0.926417 -1.274000
2020-01-02 -0.207306 -0.991458 -1.180354
2020-01-03 -0.682670 -1.826896 -0.448976
2020-01-04 -0.294884 -0.292339 -1.201342
2020-01-05 -0.405808 -1.017733 -0.859472

### Aggregation API
The aggregation API allows one to express possibly multiple aggregation operations in a single concise way. This API is similar across pandas objects, see groupby API, the window functions API, and the resample API. The entry point for aggregation is DataFrame.aggregate(), or the alias DataFrame.agg().

We will use a similar starting frame from above:

In [28]:
df = pd.DataFrame(np.random.randn(10,3), columns=list('ABC'), index=pd.date_range('1/1/2020',periods=10))
df.head(3)

                   A         B         C
2020-01-01 -1.273807 -0.627115 -0.271384
2020-01-02  0.881545  0.246565 -0.329161
2020-01-03  2.549660  0.192735  0.470195

In [32]:
df[4:6] = np.nan
df.head()

                   A         B         C
2020-01-01 -1.273807 -0.627115 -0.271384
2020-01-02  0.881545  0.246565 -0.329161
2020-01-03  2.549660  0.192735  0.470195
2020-01-04  0.448334  0.163717 -0.791699
2020-01-05       NaN       NaN       NaN

Using a single function is equivalent to apply(). You can also pass named methods as strings. These will return a Series of the aggregated output

In [31]:
df.agg(np.sum)

A    1.980315
B    2.670537
C    0.889861
dtype: float64

In [33]:
df.agg('sum')

A    1.980315
B    2.670537
C    0.889861
dtype: float64

In [34]:
df.sum()

A    1.980315
B    2.670537
C    0.889861
dtype: float64

Single aggregations on a Series this will return a scalar value:

In [35]:
df.B.agg(np.sum)

2.670537062605637

### Aggregating with multiple functions
You can pass multiple aggregation arguments as a list. The results of each of the passed functions will be a row in the resulting DataFrame. These are naturally named from the aggregation function.

In [36]:
df

                   A         B         C
2020-01-01 -1.273807 -0.627115 -0.271384
2020-01-02  0.881545  0.246565 -0.329161
2020-01-03  2.549660  0.192735  0.470195
2020-01-04  0.448334  0.163717 -0.791699
2020-01-05       NaN       NaN       NaN
2020-01-06       NaN       NaN       NaN
2020-01-07 -0.977083  0.705242 -0.153205
2020-01-08  0.614482  0.971014  1.028208
2020-01-09  0.451675  0.503764  0.472425
2020-01-10 -0.714491  0.514615  0.464482

In [38]:
df.agg([np.sum])

            A         B         C
sum  1.980315  2.670537  0.889861

Multiple functions yield multiple rows:

In [39]:
df.agg([np.mean, np.sum, 'count'])

              A         B         C
mean   0.247539  0.333817  0.111233
sum    1.980315  2.670537  0.889861
count  8.000000  8.000000  8.000000

On a Series, multiple functions return a Series, indexed by the function names:

In [40]:
df.A.agg(['sum', 'mean'])

sum     1.980315
mean    0.247539
Name: A, dtype: float64

Passing a lambda function will yield a <lambda> named row:

In [41]:
df.A.agg(['sum', lambda x: x.mean()])

sum         1.980315
<lambda>    0.247539
Name: A, dtype: float64

Passing a named function will yield that name for the row:

In [42]:
def my_mean(x):
    return x.mean()

In [43]:
df.A.agg(['sum', my_mean])

sum        1.980315
my_mean    0.247539
Name: A, dtype: float64

### Aggregating with a dict
Passing a dictionary of column names to a scalar or a list of scalars, to DataFrame.agg allows you to customize which functions are applied to which columns. Note that the results are not in any particular order, you can use an OrderedDict instead to guarantee ordering.

In [44]:
df.agg({'A': 'mean', 'B': np.sum})

A    0.247539
B    2.670537
dtype: float64

Passing a list-like will generate a DataFrame output. You will get a matrix-like output of all of the aggregators. The output will consist of all unique functions. Those that are not noted for a particular column will be NaN:

In [48]:
df.agg({'A':[np.mean, np.sum], 'B': 'count'})

              A    B
count       NaN  8.0
mean   0.247539  NaN
sum    1.980315  NaN

### Mixed dtypes
When presented with mixed dtypes that cannot aggregate, .agg will only take the valid aggregations. This is similar to how .groupby.agg works.

In [49]:
mdf = pd.DataFrame({'A': [1, 2, 3],
                    'B': [1., 2., 3.],
                    'C': ['foo', 'bar', 'baz'],
                    'D': pd.date_range('20130101', periods=3)})

In [50]:
mdf.head()

   A    B    C          D
0  1  1.0  foo 2013-01-01
1  2  2.0  bar 2013-01-02
2  3  3.0  baz 2013-01-03

In [51]:
mdf.agg(['sum', 'mean'])

        A    B          C          D
sum   6.0  6.0  foobarbaz        NaT
mean  2.0  2.0        NaN 2013-01-02

### Custom describe
With .agg() it is possible to easily create a custom describe function, similar to the built in describe function.

In [68]:
df = pd.DataFrame(np.random.randn(10, 3), columns=['A', 'B', 'C'],index=pd.date_range('1/1/2000', periods=10))

In [69]:

from functools import partial

q_25 = partial(pd.Series.quantile, q=0.25)

q_25.__name__ = '25%'
q_75 = partial(pd.Series.quantile, q=0.75)

q_75.__name__ = '75%'

In [70]:
df.agg(['count', 'mean', 'std', 'min', q_25, 'median', q_75, 'max'])

                A          B          C
count   10.000000  10.000000  10.000000
mean     0.329723   0.334401  -0.576031
std      0.760230   0.839079   1.442674
min     -0.777492  -1.142569  -2.921309
25%     -0.326927  -0.071226  -1.481872
median   0.360174   0.254289  -0.433831
75%      0.971598   0.700940   0.162863
max      1.245544   1.921925   1.620443

### Transform API
The transform() method returns an object that is indexed the same (same size) as the original. This API allows you to provide multiple operations at the same time rather than one-by-one. Its API is quite similar to the .agg API.

We create a frame similar to the one used in the above sections.

In [71]:
df = pd.DataFrame(np.random.randn(100,3), columns=list('ABC'), index=pd.date_range('1/1/2020', periods=100))
df.head()

                   A         B         C
2020-01-01  0.180361 -1.372504 -0.336172
2020-01-02 -1.004857 -0.535068 -0.197105
2020-01-03  1.433252 -0.964713  0.883643
2020-01-04 -0.258932  1.254980  0.506289
2020-01-05  0.383486  0.303450  0.363858

Transform the entire frame. .transform() allows input functions as: a NumPy function, a string function name or a user defined function.

In [73]:
df.transform(np.abs).head()

                   A         B         C
2020-01-01  0.180361  1.372504  0.336172
2020-01-02  1.004857  0.535068  0.197105
2020-01-03  1.433252  0.964713  0.883643
2020-01-04  0.258932  1.254980  0.506289
2020-01-05  0.383486  0.303450  0.363858

In [75]:
df.transform('abs').head()

                   A         B         C
2020-01-01  0.180361  1.372504  0.336172
2020-01-02  1.004857  0.535068  0.197105
2020-01-03  1.433252  0.964713  0.883643
2020-01-04  0.258932  1.254980  0.506289
2020-01-05  0.383486  0.303450  0.363858

In [77]:
df.transform(lambda x: x.abs()).head()

                   A         B         C
2020-01-01  0.180361  1.372504  0.336172
2020-01-02  1.004857  0.535068  0.197105
2020-01-03  1.433252  0.964713  0.883643
2020-01-04  0.258932  1.254980  0.506289
2020-01-05  0.383486  0.303450  0.363858

Passing a single function to .transform() with a Series will yield a single Series in return.

In [79]:
df.A.transform(np.abs).head()

2020-01-01    0.180361
2020-01-02    1.004857
2020-01-03    1.433252
2020-01-04    0.258932
2020-01-05    0.383486
Freq: D, Name: A, dtype: float64

### Transform with multiple functions
Passing multiple functions will yield a column MultiIndexed DataFrame. The first level will be the original frame column names; the second level will be the names of the transforming functions.

In [80]:
df.transform([np.abs, lambda x: x+1]).head()

                   A                   B                   C
            absolute  <lambda>  absolute  <lambda>  absolute  <lambda>
2020-01-01  0.180361  1.180361  1.372504 -0.372504  0.336172  0.663828
2020-01-02  1.004857 -0.004857  0.535068  0.464932  0.197105  0.802895
2020-01-03  1.433252  2.433252  0.964713  0.035287  0.883643  1.883643
2020-01-04  0.258932  0.741068  1.254980  2.254980  0.506289  1.506289
2020-01-05  0.383486  1.383486  0.303450  1.303450  0.363858  1.363858

Passing multiple functions to a Series will yield a DataFrame. The resulting column names will be the transforming functions.

In [81]:
df.A.transform([np.abs, lambda x: x+1]).head()

            absolute  <lambda>
2020-01-01  0.180361  1.180361
2020-01-02  1.004857 -0.004857
2020-01-03  1.433252  2.433252
2020-01-04  0.258932  0.741068
2020-01-05  0.383486  1.383486

### Transforming with a dict¶
Passing a dict of functions will allow selective transforming per column.

In [84]:
df.transform({'A': np.abs, 'B': lambda x: x+1}).head()

                   A         B
2020-01-01  0.180361 -0.372504
2020-01-02  1.004857  0.464932
2020-01-03  1.433252  0.035287
2020-01-04  0.258932  2.254980
2020-01-05  0.383486  1.303450

Passing a dict of lists will generate a MultiIndexed DataFrame with these selective transforms.

In [85]:
df.transform({'A': np.abs, 'B':[lambda x : x+1, 'sqrt']}).head()

/home/nilesh/.local/lib/python3.6/site-packages/pandas/core/series.py:679: RuntimeWarning: invalid value encountered in sqrt
  result = getattr(ufunc, method)(*inputs, **kwargs)

                   A         B
            absolute  <lambda>      sqrt
2020-01-01  0.180361 -0.372504       NaN
2020-01-02  1.004857  0.464932       NaN
2020-01-03  1.433252  0.035287       NaN
2020-01-04  0.258932  2.254980  1.120259
2020-01-05  0.383486  1.303450  0.550863

### Applying elementwise functions
Since not all functions can be vectorized (accept NumPy arrays and return another array or value), the methods applymap() on DataFrame and analogously map() on Series accept any Python function taking a single value and returning a single value. For example:

In [86]:
df.head()

                   A         B         C
2020-01-01  0.180361 -1.372504 -0.336172
2020-01-02 -1.004857 -0.535068 -0.197105
2020-01-03  1.433252 -0.964713  0.883643
2020-01-04 -0.258932  1.254980  0.506289
2020-01-05  0.383486  0.303450  0.363858

In [87]:
def f(x):
    return len(str(x))

In [89]:
df.A.map(f).head()

2020-01-01    17
2020-01-02    19
2020-01-03    18
2020-01-04    19
2020-01-05    19
Freq: D, Name: A, dtype: int64

In [91]:
df.applymap(f).head()

             A   B   C
2020-01-01  17  19  19
2020-01-02  19  19  18
2020-01-03  18  19  18
2020-01-04  19  18  18
2020-01-05  19  18  18

Series.map() has an additional feature; it can be used to easily “link” or “map” values defined by a secondary series. This is closely related to merging/joining functionality:

In [92]:
s = pd.Series(['six', 'seven', 'six', 'seven', 'six'],
            index=['a', 'b', 'c', 'd', 'e'])


t = pd.Series({'six': 6., 'seven': 7.})

In [93]:
s.head()

a      six
b    seven
c      six
d    seven
e      six
dtype: object

In [94]:
t

six      6.0
seven    7.0
dtype: float64

In [95]:
s.map(t).head()

a    6.0
b    7.0
c    6.0
d    7.0
e    6.0
dtype: float64

### Reindexing and altering labels
reindex() is the fundamental data alignment method in pandas. It is used to implement nearly all other features relying on label-alignment functionality. To reindex means to conform the data to match a given set of labels along a particular axis. This accomplishes several things:

1. Reorders the existing data to match a new set of labels

2. Inserts missing value (NA) markers in label locations where no data for that label existed

3. If specified, fill data for missing labels using logic (highly relevant to working with time series data)

Here is a simple example:

In [96]:
 s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])

In [97]:
s

a   -0.540001
b    0.712050
c   -0.434520
d    0.979912
e    0.593923
dtype: float64

In [101]:
s.reindex(['e','d','f','a','b'])

e    0.593923
d    0.979912
f         NaN
a   -0.540001
b    0.712050
dtype: float64

Here, the f label was not contained in the Series and hence appears as NaN in the result.

With a DataFrame, you can simultaneously reindex the index and columns:

In [105]:
df = {'one':[1,2,3,4,5], 'two':[6,7,8,9,10], 'three':[11,12,13,14,15]}
df = pd.DataFrame(df, index=list('abcde'))
df

   one  two  three
a    1    6     11
b    2    7     12
c    3    8     13
d    4    9     14
e    5   10     15

In [106]:
df.reindex(['e','d','a'], columns=['three', 'two'])

   three  two
e     15   10
d     14    9
a     11    6

You may also use reindex with an axis keyword:

In [107]:
df.reindex(list('ced'), axis='index')

   one  two  three
c    3    8     13
e    5   10     15
d    4    9     14

Note that the Index objects containing the actual axis labels can be shared between objects. So if we have a Series and a DataFrame, the following can be done:

In [112]:
s = pd.Series(np.arange(5), index=list('bcdea'))
s

b    0
c    1
d    2
e    3
a    4
dtype: int64

In [113]:
rs = s.reindex(df.index)
rs

a    4
b    0
c    1
d    2
e    3
dtype: int64

This means that the reindexed Series’s index is the same Python object as the DataFrame’s index.

DataFrame.reindex() also supports an “axis-style” calling convention, where you specify a single labels argument and the axis it applies to.

In [115]:
df.reindex(['c','b','d'], axis='index')

   one  two  three
c    3    8     13
b    2    7     12
d    4    9     14

In [117]:
df.reindex(['two','three','one'], axis='columns')

   two  three  one
a    6     11    1
b    7     12    2
c    8     13    3
d    9     14    4
e   10     15    5

Reindexing to align with another object
You may wish to take an object and reindex its axes to be labeled the same as another object. While the syntax for this is straightforward albeit verbose, it is a common enough operation that the reindex_like() method is available to make this simpler:

In [118]:
df = {'one':[1,2,3,4,5], 'two':[6,7,8,9,10], 'three':[11,12,13,14,15]}
df = pd.DataFrame(df, index=list('abcde'))
df

   one  two  three
a    1    6     11
b    2    7     12
c    3    8     13
d    4    9     14
e    5   10     15

In [138]:
df2 = pd.DataFrame(df, index=list('decab'))

In [143]:
df2 = df2.reindex(['three', 'two', 'one'], axis='columns')
df2

   three  two  one
d     14    9    4
e     15   10    5
c     13    8    3
a     11    6    1
b     12    7    2

In [126]:
df3 = df.reindex_like(df2)
df3

   three  two  one
d     14    9    4
e     15   10    5
c     13    8    3
a     11    6    1
b     12    7    2

### Aligning objects with each other with align¶
The align() method is the fastest way to simultaneously align two objects. It supports a join argument (related to joining and merging):

1. join='outer': take the union of the indexes (default)

2. join='left': use the calling object’s index

3. join='right': use the passed object’s index

4. join='inner': intersect the indexes

It returns a tuple with both of the reindexed Series:

In [127]:
s = pd.Series(np.arange(5), index=list('abcde'))
s1 = s[:4]
s2 = s[1:]

In [129]:
s1.align(s2)

(a    0.0
 b    1.0
 c    2.0
 d    3.0
 e    NaN
 dtype: float64,
 a    NaN
 b    1.0
 c    2.0
 d    3.0
 e    4.0
 dtype: float64)

In [130]:
s1.align(s2, join='inner')

(b    1
 c    2
 d    3
 dtype: int64,
 b    1
 c    2
 d    3
 dtype: int64)

In [131]:
s1.align(s2, join='left')

(a    0
 b    1
 c    2
 d    3
 dtype: int64,
 a    NaN
 b    1.0
 c    2.0
 d    3.0
 dtype: float64)

In [132]:
s1.align(s1, join='right')

(a    0
 b    1
 c    2
 d    3
 dtype: int64,
 a    0
 b    1
 c    2
 d    3
 dtype: int64)

In [133]:
s1.align(s2, join='outer')

(a    0.0
 b    1.0
 c    2.0
 d    3.0
 e    NaN
 dtype: float64,
 a    NaN
 b    1.0
 c    2.0
 d    3.0
 e    4.0
 dtype: float64)

For DataFrames, the join method will be applied to both the index and the columns by default:

In [139]:
df

   one  two  three
a    1    6     11
b    2    7     12
c    3    8     13
d    4    9     14
e    5   10     15

In [140]:
df2

   one  two  three
d    4    9     14
e    5   10     15
c    3    8     13
a    1    6     11
b    2    7     12

In [144]:
df.align(df2, join='inner')

(   one  two  three
 a    1    6     11
 b    2    7     12
 c    3    8     13
 d    4    9     14
 e    5   10     15,
    one  two  three
 a    1    6     11
 b    2    7     12
 c    3    8     13
 d    4    9     14
 e    5   10     15)

You can also pass an axis option to only align on the specified axis:

In [145]:
df.align(df2, join='inner', axis=0)

(   one  two  three
 a    1    6     11
 b    2    7     12
 c    3    8     13
 d    4    9     14
 e    5   10     15,
    three  two  one
 a     11    6    1
 b     12    7    2
 c     13    8    3
 d     14    9    4
 e     15   10    5)

If you pass a Series to DataFrame.align(), you can choose to align both objects either on the DataFrame’s index or columns using the axis argument

In [146]:
df.align(df2.iloc[0], axis=1)

(   one  three  two
 a    1     11    6
 b    2     12    7
 c    3     13    8
 d    4     14    9
 e    5     15   10,
 one       4
 three    14
 two       9
 Name: d, dtype: int64)